Revit 2016 API
Wire.AreVertexPointsValid Method
 Checks if the given vertex points are valid for the wire.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
public static bool AreVertexPointsValid(
	IList<XYZ> vertexPoints,
	Connector startConnector,
	Connector endConnector
)
Visual Basic
Public Shared Function AreVertexPointsValid ( _
	vertexPoints As IList(Of XYZ), _
	startConnector As Connector, _
	endConnector As Connector _
) As Boolean
Visual C++
public:
static bool AreVertexPointsValid(
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnector,
	Connector^ endConnector
)
Parameters
vertexPoints
Type: System.Collections.Generic.IList<XYZ>
 The vertex points.
startConnector
Type: Autodesk.Revit.DB.Connector
 The start connector of the wire.
endConnector
Type: Autodesk.Revit.DB.Connector
 The end connector of the wire.
Return Value
 True if the given vertex points are valid, false otherwise.
Remarks
 Vertices are projected to the view plane for comparison.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace